---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsShapeImporterAvailable
source: html/1b876c5c-c873-7347-efb9-280fa827b325.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsShapeImporterAvailable Method

Checks whether the ShapeImporter functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsShapeImporterAvailable()
```

## Returns
True if the ShapeImporter functionality is available in the installed Revit.